[
    {
        "title": "Wait A Minute, Did Alyssa Scott Just Confirm Nick Cannon Is The Father Of Her Baby?!",
        "gossip": [
            "It appears Alyssa Scott may have confirmed those baby daddy reports!",
            "On Sunday, the 27-year-old influencer shared on Instagram Stories a maternity pic of a shirtless man who appeared to be the one and only, Nick Cannon. While his face is turned away from the camera, the guy does have the Masked Singer host’s distinctive arm tattoos. Alyssa did not tag the 40-year-old, and he has not mentioned the post at all. But she did caption the photo with:"
        ],
        "image": "https://perezhilton.com/wp-content/uploads/2021/06/Alyssa-Scott-Seemingly-Confirms-She-Is-Pregnant-With-Nick-Cannon-Baby-1024x776.jpg"
    },
    {
        "title": "Ronnie Ortiz-Magro’s Ex Jen Harley Arrested For Domestic Battery & Assault With Deadly Weapon",
        "gossip": ["According to TMZ, the 34-year-old reality star was busted for domestic battery and assault with a deadly weapon in Las Vegas on Saturday. She reportedly is scheduled for a court appearance on Sunday and is currently being held at the Clark County Detention Center on a $5,000 bond. Authorities have not identified the alleged victim at this time — but TMZ noted she and ex-boyfriend Ronnie Ortiz-Magro co-owned a house in the area."],
        "image": "https://perezhilton.com/wp-content/uploads/2021/06/Jen-Harley-Arrest-For-Domestic-Battery-And-Assault-With-Deadly-Weapon-1024x829.jpg"
    },
    {
        "title": "Chrissy Teigen FIRES BACK At Michael Costello Over 'Fake' DM Controversy: 'You Are Now Causing Actual Pain'",
        "gossip": [
            "Chrissy Teigen is coming to her own defense over the whole Michael Costello DMs controversy, and she isn’t holding back!",
            "Not long after John Legend went to bat for her online, the former model returned to social media on Friday following her public apology to share her own thoughts on the fashion designer’s allegations and “completely fake” messages."
        ],
        "image": "https://perezhilton.com/wp-content/uploads/2021/06/Chrissy-Teigen-Reponds-To-Michael-Costello-Claims-1024x840.jpeg"
    },
     {
        "title": "Why Kylie Jenner Kept Her Pregnancy Secret, Even From KUWTK Producers!",
        "gossip": [
            "Kylie Jenner’s pregnancy wasn’t just kept hidden from the public — but apparently from the Keeping Up With the Kardashians’ producers as well! ",
            "As you may call, the 23-year-old reality star stepped away from the spotlight for a majority of 2017 amid speculation she and Travis Scott were expecting their first child together. But the pair didn’t officially announce the happy news until February 2018, sharing an adorable compilation video from Kylie’s pregnancy and some Instagram pics from Stormi Webster’s birth."
        ],
        "image": "https://perezhilton.com/wp-content/uploads/2021/06/Kylie-Jenner-Even-Hid-Her-Pregnancy-From-KUWTK-Producers-1024x790.jpg"
    }
]

